Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Notice how self is used to distinguish the name property from the name argument to the initializer.
ja: どのようにselfがnameプロパティをイニシャライザのためのname引数と区別するために使われるかに注意してください。

source: Notice how the sunrise and sunset times are extracted from the ServerResponse value as part of matching the value against the switch cases.
ja: どのように日の出と日没の時間がServerResponseの値から、その値をスイッチの各条件と比較することの一環として抽出されるかに注意してください。

source: Notice that the initializer for the EquilateralTriangle class has three different steps:
ja: EquilateralTriangleクラスのためのイニシャライザが３つの異なる段階を持つことに注意してください：

source: Notice the two ways that the hearts case of the enumeration is referred to above: When assigning a value to the hearts constant, the enumeration case Suit.hearts is referred to by its full name because the constant doesn’t have an explicit type specified.
ja: 上記で列挙のheartsケース節が参照される２つの方法に注意してください：定数のheartsに値を代入するとき、列挙のケース節Suit.heartsはそのフルネームによって参照されます、なぜならこの定数には明確に指定される型がないからです。

source: Notice the use of the mutating keyword in the declaration of SimpleStructure to mark a method that modifies the structure.
ja: SimpleStructureの宣言におけるmutatingキーワードに注意してください、それはその構造体を修正するメソッドに印を付けるためのものです。

source: Now that moveNearerToZero refers to the correct function, it can be used to count to zero:
ja: moveNearerToZeroが正しい関数に言及する今、それはゼロまで数えるために使われることができます：

source: Now you can call the function as if it took a String argument instead of a closure.
ja: 今やあなたはこの関数を、まるでそれがクロージャではなくString引数を取るかのように呼び出せます。

source: Null character (\0)
ja: null文字（\0）

source: Numbers can overflow in both the positive and negative direction.
ja: 数は正と負の向きの両方においてオーバフローすることができます。

source: Numeric Literals
ja: 数のリテラル

source: Numeric Type Conversion
ja: 数の型変換

source: Numeric literals can contain extra formatting to make them easier to read.
ja: 数のリテラルは、それらをより簡単に読めるように書式を整える追加のものを含むことができます。

source: Objects and Classes
ja: オブジェクトとクラス

source: Omitting Argument Labels
ja: 引数ラベルの省略

source: Omitting the return from a getter follows the same rules as omitting return from a function, as described in Functions With an Implicit Return.
ja: returnをゲッターから省くことは、returnを関数から省くのと同じ規則に従います、暗黙的なreturnをもつ関数で記述されるように。

source: Omitting the version number indicates that the declaration is currently deprecated, without giving any information about when the deprecation occurred.
ja: バージョン番号の省略は、宣言が現れた時についてのどんな情報も与えることなく、その宣言が現在は非推奨であることを示します。

source: On a 32-bit platform, Int is the same size as Int32.
ja: 32ビットのプラットホーム上で、IntはInt32と同じサイズです。

source: On a 32-bit platform, UInt is the same size as UInt32.
ja: 32ビットのプラットホーム上で、UIntはUInt32と同じサイズです。

source: On a 64-bit platform, Int is the same size as Int64.
ja: 64ビットのプラットホーム上で、IntはInt64と同じサイズです。

source: On a 64-bit platform, UInt is the same size as UInt64.
ja: 64ビットのプラットホーム上で、UIntはUInt64と同じサイズです。

source: On a Mac with Xcode installed, or on an iPad with Swift Playgrounds, you can open this chapter as a playground.
ja: XcodeがインストールされたMac上で、またはSwift Playgroundsを備えたiPad上で、あなたはこの章をプレイグラウンドとして開くことができます。

source: On each pass, the for-in loop sets the item constant to the next MediaItem in the array.
ja: 各段階で、このfor-inループはitem定数を次のMediaItemに設定します。

source: On those occasions, you can write try! before the expression to disable error propagation and wrap the call in a runtime assertion that no error will be thrown.
ja: これらの場合には、あなたはtry!をその式の前に書くことによって、エラー伝達を抑制して、エラーはスローされないという実行時表明の中にその呼び出しを包み込みます。

source: Once directionToHead is declared as a CompassPoint, you can set it to a different CompassPoint value using a shorter dot syntax:
ja: 一旦directionToHeadが、あるCompassPointとして宣言されるならば、あなたはそれをより短いドット構文を使って、異なるCompassPoint値に設定することができます：

source: Once a constant property is assigned a value, it can’t be further modified.
ja: いったん定数プロパティが値を割り当てられるならば、それはそれ以上変更されることはできません。

source: Once it completes the sorting process, the sorted(by:) method returns a new array of the same type and size as the old one, with its elements in the correct sorted order.
ja: 一旦それがソート処理を完了するならば、sorted(by:)メソッドは、古いものと同じ型と大きさの新しい配列を返します、そしてその要素は正しく分類された順序を持ちます。

source: Once the counter reaches zero, no more counting takes place:
ja: ひとたびcounterがゼロに達するならば、それ以上数えることは起こりません：

source: Once the initial state for every stored property has been determined, the second phase begins, and each class is given the opportunity to customize its stored properties further before the new instance is considered ready for use.
ja: 一旦あらゆる格納プロパティのための最初の状態が決定されるならば、第２の段階が始まります、そして各クラスは、新しいインスタンスが使用する準備ができているとみなされる前に、さらにその格納プロパティを好みに合わせて作り変える機会を与えられます。

source: Once the superclass’s designated initializer is finished, the subclass’s designated initializer can perform additional customization (although again, it does not have to).
ja: 一旦スーパークラスの指定イニシャライザが作業をし終えるならば、サブクラスの指定イニシャライザは追加の改良を実行することができます（しかし再び、そうしなければならない訳ではない）。

source: Once the top of the chain is reached, and the final class in the chain has ensured that all of its stored properties have a value, the instance’s memory is considered to be fully initialized, and phase 1 is complete.
ja: いったん連鎖の最上部に届き、そして連鎖の中の最終的なクラスがその格納プロパティの全てが値を持つことを確実にしたならば、インスタンスのメモリは充分に初期化されるとみなされます、そして、第１段階は完了です。

source: Once you define a type alias, you can use the alias anywhere you might use the original name:
ja: 一旦あなたがある型エイリアスを定義するならば、あなたが本来の名前を使うであろうどこにでも、あなたはそのエイリアスを使用することができます：

source: Once you specify a type parameter, you can use it to define the type of a function’s parameters (such as the a and b parameters of the swapTwoValues(_:_:) function), or as the function’s return type, or as a type annotation within the body of the function.
ja: 一旦あなたが型パラメータを指定するならば、あなたはそれを、関数のパラメータの型を定義するために（例えば、 swapTwoValues(_:_:)関数のaとbパラメータのように）、または関数の戻り型として、あるいは関数の本文内の型注釈として使用することができます。

source: Once you’re sure that the optional does contain a value, you can access its underlying value by adding an exclamation point (!) to the end of the optional’s name.
ja: 一旦あなたがそのオプショナルが値を含んでいることを確かめたなら、あなたは感嘆符（!）をオプショナルの名前の終わりに加えることによって、それに内在する値にアクセスすることが可能です。

source: Once you’ve declared a constant or variable of a certain type, you can’t declare it again with the same name, or change it to store values of a different type.
ja: 一旦あなたが特定の型のある定数または変数を宣言してしまったならば、あなたは同じ名前でもう一度それを宣言し直すこと、またはそれを異なる型の値を格納するように変更することは出来ません。

source: One consequence of this long-term write access is that you can’t access the original variable that was passed as in-out, even if scoping rules and access control would otherwise permit it—any access to the original creates a conflict.
ja: この長期書き込みアクセスの１つの帰結として、あなたはin-outとして渡された元の変数にアクセス出来ません、たとえスコープ規則とアクセス制御がその他の点ではそれを許すとしてもです — 元のものに対するどんなアクセスも衝突を作り出します。

source: One convenience initializer calls another convenience initializer, which in turn calls the single designated initializer.
ja: １つの便宜イニシャライザは、別の便宜イニシャライザを呼びます、それは、今度は１つだけある指定イニシャライザを呼びます。

source: One example is the addition assignment operator (+=):
ja: １つの例は、加算代入演算子（+=）です：

source: One kilometer is the same as 1,000 meters, so the km computed property multiplies the value by 1_000.00 to convert into a number expressed in meters.
ja: １キロメートルは1,000メートルと同じものですので、km計算プロパティは1_000.00を掛けられて、メートルで表される数に変換されます。

source: One of the most important differences between structures and classes is that structures are always copied when they are passed around in your code, but classes are passed by reference.
ja: 構造体とクラスの間の１つの最も重要な違いは、それらがあなたのコードにおいてあちこち渡されるとき、構造体は常にコピーされるということです、それに対してクラスは参照によって渡されます。

source: One of these classes is defined as internal, and the other is defined as private.
ja: それらのクラスのうちの１つは内部として定義されます、そして別のものは非公開として定義されます。

source: One of these two branches is always executed.
ja: これらの２つの分岐のうちの１つは、常に実行されます。

source: One way is to use do-catch.
ja: １つの方法は、do-catchを使うことです。

source: One way that a closure can escape is by being stored in a variable that is defined outside the function.
ja: クロージャが脱出できる１つの方法は、関数の外側で定義される変数に格納されることです。

source: One way to fix invalidFlip(_:) is to move the special case for squares into the implementation of FlippedShape, which lets this function always return a FlippedShape value:
ja: invalidFlip(_:)を修正する１つの方法は、正方形の特別な事例をFlippedShapeの実装へと移動することです、それはこの関数に常にFlippedShape値を返させます：

source: One way to provide the sorting closure is to write a normal function of the correct type, and to pass it in as an argument to the sorted(by:) method:
ja: ソート・クロージャを提供する１つの方法は、通常の関数を正しい型で記述することです、そしてそれを１つの引数としてsorted(by:)メソッドに渡すことになります：

source: One way to solve this conflict is to make an explicit copy of stepSize:
ja: この衝突を解決する１つの方法は、明示的にstepSizeのコピーを作ることです：

source: One-Sided Ranges
ja: 片側範囲

source: One-sided ranges can be used in other contexts, not just in subscripts.
ja: 片側範囲は、添え字とは違い、他の文脈で使用できます。

source: Only the compound assignment operators can be overloaded.
ja: 複合代入演算子だけが、オーバーロードされることができます。

source: Only throwing functions can propagate errors.
ja: スロー関数だけがエラーを伝えることができます。

source: Opaque Type
ja: 不透明型

source: Opaque Types
ja: 不透明型

source: Opaque types appear as the return type of a function or subscript, or the type of a property.
ja: 不透明型は、関数または添え字の戻り型、またはあるプロパティの型として現れます。

source: Opaque types can’t appear as part of a tuple type or a generic type, such as the element type of an array or the wrapped type of an optional.
ja: 不透明型は、タプル型または総称体型の一部として現れることができません、たとえば配列の要素型、またはオプショナルのラップ型などの。

source: Opaque types have the following form:
ja: 不透明型は以下の形式を持ちます：

source: Open access applies only to classes and class members, and it differs from public access by allowing code outside the module to subclass and override, as discussed below in Subclassing.
ja: 解放アクセスは、クラスとクラスメンバにのみ適用されます、そしてそれは公開アクセスとは、モジュールの外側のコードにサブクラス作成およびオーバーライドをさせることによって異なります、下のサブクラスをつくるで議論されるように。

source: Open access is the highest (least restrictive) access level and private access is the lowest (most restrictive) access level.
ja: 開放アクセスは最も高い（制限の最も少ない）アクセス水準であり、非公開アクセスは最も低い（制限の最も多い）アクセス水準です。

source: Operator associativity defines how operators of the same precedence are grouped together—either grouped from the left, or grouped from the right.
ja: 演算子結合性は、同じ優先順位の演算子がまとめられる方法を定義します ― 左からまとめられるか右からまとめられるかのどちらか。

source: Operator precedence gives some operators higher priority than others; these operators are applied first.
ja: 演算子優先順位は、ある演算子に他のものよりも高い優先権を与えます；これらの演算子は最初に適用されます。

source: Operator Declaration
ja: 演算子宣言

source: Operator Methods
ja: 演算子メソッド

source: Operator functions for Compound Assignment Operators no longer use the @assignment attribute when defining the function.
ja: 複合代入演算子のための演算子関数は、もはや関数を定義する時に@assignment属性を使いません。

source: Operators
ja: 演算子

source: Operators are unary, binary, or ternary:
ja: 演算子には、単項、二項、または三項があります：

source: Operators from those precedence groups can’t be used next to each other without grouping parentheses.
ja: それらの優先順位グループ由来の演算子は、グループ化括弧なしで互いにすぐ隣に使われることができません。

source: Operators that are left-associative group left-to-right.
ja: 左結合である演算子は、左から右へとグループにまとめられます。

source: Operators that are right-associative group right-to-left, and operators that are specified with an associativity of none don’t associate at all.
ja: 右結合の演算子は右から左にグループにされます、そしてnoneの関係性を指定される演算子は全く結合しません。

source: Optional Binding
ja: オプショナルを束縛する（定数・変数と結び付ける）

source: Optional Chaining
ja: オプショナル連鎖

source: Optional Chaining as an Alternative to Forced Unwrapping
ja: 強制アンラップに代わるものとしてのオプショナル連鎖

source: Optional Pattern
ja: オプショナルパターン

source: Optional Property Types
ja: オプショナルプロパティ型

source: Optional Protocol Requirements
ja: オプショナルのプロトコル要件

source: Optional Tuple Return Types
ja: オプショナルタプルの戻り型

source: Optional Type
ja: オプショナル型

source: Optional binding can be used with if and while statements to check for a value inside an optional, and to extract that value into a constant or variable, as part of a single action.
ja: オプショナル束縛は、ifやwhile文と一緒に使用して、オプショナルの内部の値を確認すること、そしてその値を定数または変数に抽出することを、一回の動作で可能にします。

source: Optional chaining in Swift is similar to messaging nil in Objective-C, but in a way that works for any type, and that can be checked for success or failure.
ja: スウィフトにおけるオプショナル連鎖は、どんな型のためにでも働きそして成功か失敗を確認されることができるというようなことを除いて、Objective-Cにおけるnilにメッセージを送ることに似ています。

source: Optional chaining provides an alternative way to access the value of numberOfRooms.
ja: オプショナル連鎖は、numberOfRoomsの値にアクセスする代わりの方法を提供します。

source: Optional patterns consist of an identifier pattern followed immediately by a question mark and appear in the same places as enumeration case patterns.
ja: オプショナルパターンは、１つの識別子パターンに直接に１つの疑問符が続くものから成ります、そして列挙ケース節パターンと同じ場所に現れます。

source: Optional requirements are available so that you can write code that interoperates with Objective-C.
ja: オプショナル要件が利用可能なことから、あなたはObjective-Cと相互運用するコードを書くことができます。

source: Optional requirements are prefixed by the optional modifier as part of the protocol’s definition.
ja: オプショナルの要件は、そのプロトコル定義においてoptional修飾子を前に置かれます。

source: Optional syntactic categories and literals are marked by a trailing subscript, opt.
ja: 任意である統語論のカテゴリーとリテラルは後に続く下つき文字、optによって印されます。

source: Optional-Chaining Expression
ja: オプショナル連鎖式

source: Optional-chaining expressions must appear within a postfix expression, and they cause the postfix expression to be evaluated in a special way.
ja: オプショナル連鎖式は、接尾辞式の中に現れなければなりません、そしてそれはその接尾辞式を特別なやり方で評価されるようにします。

source: Optionals
ja: オプショナル

source: Optionals are used to represent the absence of a value, but when an operation fails, it’s often useful to understand what caused the failure, so that your code can respond accordingly.
ja: オプショナルは、ある値の欠如を表すために使われます、しかしある操作が失敗する時、何がその失敗をもたらしたのか理解するのはしばしば役に立ちます、それであなたのコードはそれに適切に応答することができます。

source: Optionals can be checked with an if statement to see if a value exists, and can be conditionally unwrapped with optional binding to access the optional’s value if it does exist.
ja: オプショナルは、値が存在しているかどうか見るために、if文を使って調べられることが出来ます、そしてオプショナルの持つ値にそれが存在するならばアクセスするために、オプショナル束縛を使って条件に応じてアンラップされることができます。

source: Optionals ensure that nil values are handled explicitly.
ja: オプショナルが、nil値が明確に取り扱われるのを確実にする。

source: Optionals of any type can be set to nil, not just object types.
ja: すべての型のオプショナルが、nilに設定されることができます、単にオブジェクト型だけでなく。

source: Optionals say either “there is a value, and it equals x” or “there isn’t a value at all”.
ja: オプショナルであるものは、「ひとつの値がある、そしてそれはxに等しい」または「まったく値がない」のどちらかを伝えます。

source: Other Swift functions can’t be converted to the C calling convention.
ja: 他のスウィフト関数は、C呼出規約に変換されることはできません。

source: Other named types can only inherit from or conform to a list of protocols.
ja: 他の名前付きの型は、プロトコルのリストから継承し準拠することだけができます。

source: Other products are labeled with 2D barcodes in QR code format, which can use any ISO 8859-1 character and can encode a string up to 2,953 characters long:
ja: 別の製品はQRコード形式の二次元バーコードでラベルをつけられます、それはどんなISO 8859-1の文字でも使うことができて、2,953文字までの長さの文字列をコード化することができます：

source: Other units require some conversion to be expressed as a value measured in meters.
ja: 他の単位は、メートルで計られる値として表されるためにいくらかの変換を必要とします。

source: Other valid versions of this function could return values of different types when flipping multiple instances of the same shape.
ja: この関数の他の有効なバージョンそれらは、異なる型の値を返すことが、同じ形状の複数のインスタンスを裏返す時にありえます。

source: Otherwise, nourish(with:) propagates the error to its call site.
ja: そうでなければ、nourish(with:)はそのエラーをそれの呼出地点へと伝達します。

source: Otherwise, a runtime error is raised.
ja: そうでなければ、実行時エラーが引き起こされます。

source: Otherwise, it evaluates the second expression and returns its value.
ja: そうでなければ、それは第二の式を評価して、その値を返します。

source: Otherwise, no message is printed, and code execution continues after the if statement’s closing brace.
ja: そうでなければ、メッセージは出力されません、そしてコードの実行はif文の閉じ波括弧の後に続きます。

source: Otherwise, the species property’s value is set, and initialization succeeds:
ja: そうでなければ、speciesプロパティの値は設定されて、初期化は成功します：

source: Otherwise, the closure expression is escaping.
ja: それ以外では、クロージャ式は脱出です。

source: Otherwise, the error can propagate out of the containing scope, which means the error must be handled by an enclosing catch clause or the containing function must be declared with throws.
ja: そうでなければ、エラーはそれを収容しているスコープの外に伝えられることができます、それが意味するのは、エラーは囲んでいるcatch節によって取り扱われなければならない、または収容している関数がthrowsで宣言されなければならないということです。

source: Otherwise, the initializer has an access level of internal.
ja: そうでなければ、イニシャライザは内部のアクセス水準を持ちます。

source: Otherwise, the nested function is an escaping function.
ja: それ以外では、入れ子にされた関数は脱出関数です。

source: Otherwise, the optional value is unwrapped and assigned to the constant after let, which makes the unwrapped value available inside the block of code.
ja: そうでなければ、そのオプショナルの値は包装を取られて（アンラップされて）、letの後の定数に代入されます、そしてそれはコードのブロックの内側で利用できる包装を取られた値（アンラップ値）になります。

source: Otherwise, the optional value is unwrapped, and everything after the ? acts on the unwrapped value.
ja: そうでなければ、オプショナルの値は包装を取られます（アンラップされます）、そして?の後のすべてのものは包装を取られた値（アンラップ値）に作用します。

source: Otherwise, the program does not perform assignment or execute the statements, and it is finished executing the for-in statement.
ja: そうでなければ、プログラムは代入を実行しませんし、文を実行しません、そしてそれはfor-in文の実行を終了します。

source: Otherwise, the result is an optional containing the value that the function returned.
ja: そうでなければ、結果は関数が返した値を含んでいるオプショナルです。

source: Otherwise, the square’s value is 0, and it’s a “free” square, represented by ○.
ja: 一方、正方形の値は0ならば、それは「自由」な正方形であって、○によって表されます。

source: Otherwise, the subscript returns nil:
ja: そうでなければ、添え字はnilを返します：

source: Otherwise, the value of x and y is the value that the function returned.
ja: そうでなければ、xとyの値はこの関数が返す値です。

source: Otherwise, the value of the optional-try expression is nil.
ja: そうでなければ、オプショナルtry式の値はnilです。

source: Otherwise, when set to false or omitted, operators in the precedence group follows the same optional chaining rules as operators that don’t perform assignment.
ja: そうせずに、falseに設定するか省略する場合は、その優先順位グループの演算子は代入を実行しない演算子と同じオプショナル連鎖規則に従います。

source: Our goals for Swift are ambitious.
ja: スウィフトのための私達のゴールは、野心的です。

source: Outside the context in which they appear in the grammar, they can be used as identifiers.
ja: そこにおいてそれらが文法の中に現れる文脈外では、それらは識別子として使われることができます。

source: Overflow Operators
ja: オーバフロー演算子

source: Overflow addition (&+)
ja: オーバフロー加算（&+）

source: Overflow also occurs for signed integers.
ja: オーバフローはまた、符号つき整数に対しても起こります。

source: Overflow behavior is trapped and reported as an error.
ja: オーバフロー挙動は、エラーとして捕まえられて報告されます。

source: Overflow multiplication (&*)
ja: オーバフロー乗算（&*）

source: Overflow subtraction (&-)
ja: オーバフロー減算（&-）

source: Overlapping accesses appear primarily in code that uses in-out parameters in functions and methods or mutating methods of a structure.
ja: オーバーラップするアクセスは、関数およびメソッドにおいてまたは構造体の変更メソッドにおいてin-outパラメータを使うコードに主に現れます。

source: Overridden Requirements Aren’t Used in Some Generic Contexts
ja: オーバーライドされた要件はいくつかの総称体文脈では使われません

source: Overridden properties, methods, subscripts, and designated initializers must be marked with the override declaration modifier.
ja: プロパティ、メソッド、添え字、そして指定イニシャライザのオーバーライドは、override宣言修飾子で印されなければなりません。

source: Overriding
ja: オーバーライド

source: Overriding Methods
ja: メソッドのオーバーライド

source: Overriding Properties
ja: プロパティのオーバーライド

source: Overriding Property Getters and Setters
ja: プロパティゲッターとセッターのオーバーライド

source: Overriding Property Observers
ja: プロパティオブザーバーのオーバーライド

source: Overriding a Failable Initializer
ja: 失敗できるイニシャライザのオーバーライド

source: Overriding by accident can cause unexpected behavior, and any overrides without the override keyword are diagnosed as an error when your code is compiled.
ja: 誤って偶然にオーバーライドすることは予想外の挙動を引き起こすことがありえます、なので、あなたのコードがコンパイルされるとき、overrideキーワードのないどんなオーバーライドもエラーとして診断されます。

source: Overusing autoclosures can make your code hard to understand.
ja: 自動クロージャの使いすぎは、あなたのコードを理解しにくくする可能性があります。

source: Parameter Names
ja: パラメータ名

source: Parameter Names and Argument Labels
ja: パラメータ名と引数ラベル

source: Parameters can be ignored, take a variable number of values, and provide default values using the following forms:
ja: パラメータは、無視されること、可変の数の値をとること、そして以下の形式を使って省略時の値を提供することができます：

source: Parameters can provide default values to simplify function calls and can be passed as in-out parameters, which modify a passed variable once the function has completed its execution.
ja: パラメータは、関数呼び出しを単純化するために初期値を提供することができます、そしてひとたび関数がその実行を完了し終えれば渡された変数を修正するin-outパラメータとして渡されることができます。

source: Parameters that don’t have default values are usually more important to the function’s meaning—writing them first makes it easier to recognize that the same function is being called, regardless of whether any default parameters are omitted.
ja: 省略時の値を持たないパラメータは、関数の意味するところにとって通常より重要です—それらを最初に書くことは、何らかの省略時のパラメータが省かれているかどうかに関係なく、同じ関数が呼び出されているのをよりわかり易くします。

source: Parentheses around the condition or loop variable are optional.
ja: 条件またはループ変数のまわりの丸括弧は任意です。

source: Parenthesized Expression
ja: 括弧に入れられた式

source: Part of the functionality of the DataManager class is the ability to import data from a file.
ja: DataManagerクラスの機能性の一部は、データをファイルからインポートする能力です。

source: Passing birthdayPerson to the beginConcert(in:) function is invalid because Person isn’t a subclass of Location.
ja: birthdayPersonをbeginConcert(in:)関数に渡すことは無効です、なぜならPersonはLocationのサブクラスではないからです。

source: Patterns
ja: パターン

source: Performing Set Operations
ja: 集合演算の実行

source: Phase 1
ja: 第１段階

source: Phase 2
ja: 第２段階

source: Place parameters that don’t have default values at the beginning of a function’s parameter list, before the parameters that have default values.
ja: 省略時の値を持たないパラメータを関数のもつパラメータリストの始まりに、省略時の値を持つパラメータの前に、置いてください。

source: Place the capture list before a closure’s parameter list and return type if they are provided:
ja: それらが提供されるならばクロージャのパラメータ・リストと戻り型の前に、捕獲リストを置いてください：

source: Platform condition
ja: プラットホーム条件

source: Playground literals in plain text outside of Xcode are represented using a special literal syntax.
ja: Xcodeの外部のプレーンテキストの中のプレイグラウンドリテラルは、特別なリテラル構文を使って表されます。

source: Playgrounds allow you to edit the code listings and see the result immediately.
ja: プレイグラウンドは、あなたがコードリストを編集してすぐにその結果を見られるようにします。

source: Pointers
ja: ポインター

source: Popping a value from the stack removes and returns the top value, "cuatro":
ja: このスタックから値をボップすることは、一番上の値、"cuatro"を削除して、返します：

source: Positive numbers are stored in exactly the same way as for unsigned integers, counting upwards from 0.
ja: 正の数は符号なし整数と正確に同じ方法で格納されて、0から上方へ数えます。

source: Postfix Expressions
ja: 接尾辞表現

source: Postfix Self Expression
ja: 接尾辞self式

source: Postfix expressions, like prefix and binary expressions, let you build up more complex expressions using postfixes such as function calls and member access.
ja: 接尾辞式は、接頭辞や二項の式に似て、関数呼び出しやメンバー・アクセスのような接尾辞を使うことで、あなたにより複雑な式を組み立てさせます。

source: Postfix operators are nonassociative.
ja: 接尾辞演算子は非結合です。

source: Precedence Group Declaration
ja: 優先順位グループ定義

source: Precedence and Associativity
ja: 優先順位と結合性

source: Precedence for Custom Infix Operators
ja: あつらえの接中辞演算子の優先順位

source: Precedence groups related to each other using lower group names and higher group names must fit into a single relational hierarchy, but they don’t have to form a linear hierarchy.
ja: 下方グループ名と上方グループ名を使って互いに関係のある優先順位グループは、単一の関係階層へはめ込まなければなりません、しかしそれらは線形階層を形作る必要はありません。

source: Prefix Expressions
ja: 接頭辞式

source: Prefix and Postfix Operators
ja: 接頭辞と接尾辞演算子

source: Prefix and Suffix Equality
ja: 接頭辞と接尾辞等式

source: Prefix and binary expressions let you apply operators to smaller expressions.
ja: 接頭辞と二項式は、あなたに演算子をより小さい式に適用させます。

source: Prefix operators are nonassociative.
ja: 接頭辞演算子は非結合です。

source: Prefix operators declarations don’t specify a precedence level.
ja: 接頭辞演算子宣言は、優先順位レベルを指定しません。

source: Prefix operators take one argument, the expression that follows them.
ja: 接頭辞演算子は、１つの引数（それらの後に続く式）をとります。

source: Preventing Overrides
ja: オーバーライドを防ぐ

source: Primary Expressions
ja: 基本式

source: Primary expressions are conceptually the simplest kind of expression, and they provide a way to access values.
ja: 基本式は、概念的に最も単純な種類の式で、それらはアクセス手段をさまざまな値に提供します。
